{"0": "UNK", "1": "NONE", "2": "psrlq", "3": "rol", "4": "pmulhrsw", "5": "cmpnlepd", "6": "vpermilps", "7": "cmpeqsd", "8": "vorpd", "9": "vsubps", "10": "psrld", "11": "rdtsc", "12": "ror", "13": "setl", "14": "scasw", "15": "movnti", "16": "pblendvb", "17": "maxss", "18": "scasd", "19": "scasb", "20": "unpckhps", "21": "wbinvd", "22": "palignr", "23": "vdivsd", "24": "unpckhpd", "25": "sal", "26": "punpckldq", "27": "pextrw", "28": "fnstcw", "29": "pmaddwd", "30": "cmc", "31": "leave", "32": "pextrd", "33": "pextrb", "34": "fcmovnbe", "35": "pavgb", "36": "cmp", "37": "cmpnlesd", "38": "psubw", "39": "setnle", "40": "pandn", "41": "fxam", "42": "vmulps", "43": "wrmsr", "44": "xor", "45": "sub", "46": "neg", "47": "sets", "48": "vpsllw", "49": "lea", "50": "paddusw", "51": "les", "52": "paddusb", "53": "fild", "54": "wait", "55": "pfsubr", "56": "movsw", "57": "minss", "58": "xorpd", "59": "lsl", "60": "pavgusb", "61": "pause", "62": "fsub", "63": "clflush", "64": "pfrcp", "65": "cmovge", "66": "ucomiss", "67": "fsqrt", "68": "setno", "69": "faddp", "70": "setnb", "71": "setnz", "72": "fdivp", "73": "setns", "74": "setnp", "75": "fcomi", "76": "jmp", "77": "rcpss", "78": "movd", "79": "movsd", "80": "fucom", "81": "fcomp", "82": "vpsrad", "83": "shr", "84": "fcmovbe", "85": "fnsave", "86": "cmpps", "87": "dec", "88": "fld", "89": "addsd", "90": "movaps", "91": "pslld", "92": "pslldq", "93": "movapd", "94": "fistp", "95": "pminsw", "96": "addss", "97": "movlpd", "98": "psllq", "99": "minps", "100": "ficomp", "101": "pcmpgtw", "102": "vmovups", "103": "getsec", "104": "idiv", "105": "pcmpgtb", "106": "pcmpgtd", "107": "punpckhbw", "108": "fucompp", "109": "insb", "110": "insd", "111": "iret", "112": "vunpckhps", "113": "pshuflw", "114": "insw", "115": "lar", "116": "sfence", "117": "lodsw", "118": "subpd", "119": "fldenv", "120": "cmovns", "121": "cmovnp", "122": "cmovno", "123": "movlps", "124": "lodsd", "125": "enter", "126": "jnp", "127": "fnclex", "128": "sqrtsd", "129": "jnz", "130": "imul", "131": "jnb", "132": "sqrtss", "133": "shrd", "134": "lss", "135": "pand", "136": "fisub", "137": "pinsrw", "138": "monitor", "139": "divps", "140": "cld", "141": "clc", "142": "pinsrd", "143": "pmovzxwd", "144": "fadd", "145": "movntps", "146": "sysret", "147": "pmaxub", "148": "shufpd", "149": "prefetchw", "150": "shufps", "151": "fdivr", "152": "ftst", "153": "pmulhuw", "154": "not", "155": "vunpcklps", "156": "nop", "157": "xbegin", "158": "pmaxsw", "159": "addps", "160": "punpcklwd", "161": "int", "162": "pminuw", "163": "hlt", "164": "loope", "165": "comisd", "166": "cmpleps", "167": "lfs", "168": "pminub", "169": "fsubrp", "170": "orpd", "171": "ret", "172": "pmovzxbd", "173": "fdivrp", "174": "insertps", "175": "invd", "176": "cwd", "177": "ucomisd", "178": "sbb", "179": "fidiv", "180": "pshufhw", "181": "sahf", "182": "fcos", "183": "vxorps", "184": "movups", "185": "fxsave", "186": "paddq", "187": "maxps", "188": "fcom", "189": "clts", "190": "xabort", "191": "cli", "192": "fmul", "193": "psubusw", "194": "pcmpeqb", "195": "pcmpeqd", "196": "lidt", "197": "psubb", "198": "roundps", "199": "pmuludq", "200": "vmovapd", "201": "cmpneqpd", "202": "vrcpss", "203": "shld", "204": "std", "205": "paddsw", "206": "psraw", "207": "fisubr", "208": "stc", "209": "fucomp", "210": "fucomi", "211": "paddsb", "212": "fsubp", "213": "str", "214": "punpcklqdq", "215": "vpcmpgtw", "216": "and", "217": "psubq", "218": "andpd", "219": "fsetpm", "220": "extractps", "221": "cpuid", "222": "sar", "223": "andps", "224": "vblendps", "225": "subps", "226": "fnstenv", "227": "lodsb", "228": "fsincos", "229": "fnop", "230": "outsw", "231": "bsr", "232": "ffree", "233": "fstp", "234": "outsb", "235": "outsd", "236": "fincstp", "237": "cwde", "238": "punpcklbw", "239": "mulps", "240": "vpaddw", "241": "divsd", "242": "fimul", "243": "vpshufhw", "244": "divss", "245": "vpcmpeqw", "246": "popf", "247": "cdq", "248": "pfmax", "249": "fxch", "250": "psrlw", "251": "movntq", "252": "arpl", "253": "cmpneqps", "254": "psubd", "255": "vmovaps", "256": "sysenter", "257": "punpckhdq", "258": "vandnpd", "259": "pfsub", "260": "pxor", "261": "shl", "262": "cmplesd", "263": "bts", "264": "btr", "265": "unpcklpd", "266": "frstor", "267": "sti", "268": "prefetchnta", "269": "packsswb", "270": "btc", "271": "psrad", "272": "ldmxcsr", "273": "vmovd", "274": "pmulhw", "275": "mul", "276": "movq", "277": "vaddps", "278": "jge", "279": "vmovsd", "280": "jp", "281": "jcxz", "282": "js", "283": "jl", "284": "vmovddup", "285": "jg", "286": "fcompp", "287": "jb", "288": "vpshuflw", "289": "cmovp", "290": "cmovs", "291": "cmovl", "292": "cmovo", "293": "cmova", "294": "cmovb", "295": "vshufps", "296": "cmovg", "297": "punpckhwd", "298": "xorps", "299": "fidivr", "300": "por", "301": "pabsw", "302": "movhpd", "303": "setnbe", "304": "xadd", "305": "movhlps", "306": "retf", "307": "vpmaddwd", "308": "retn", "309": "vpunpckldq", "310": "ja", "311": "fisttp", "312": "syscall", "313": "cmovbe", "314": "sqrtps", "315": "vpextrw", "316": "movdqa", "317": "fnstsw", "318": "lgdt", "319": "lgs", "320": "jno", "321": "pfmul", "322": "align", "323": "andnpd", "324": "cmovle", "325": "pfcmpgt", "326": "fldpi", "327": "packuswb", "328": "cmpltsd", "329": "lahf", "330": "andnps", "331": "loop", "332": "punpckhqdq", "333": "pmullw", "334": "fcmovu", "335": "psubsb", "336": "fcmove", "337": "vpunpckhbw", "338": "xchg", "339": "fcmovb", "340": "jz", "341": "setbe", "342": "fabs", "343": "fbld", "344": "setle", "345": "movlhps", "346": "sysexit", "347": "bswap", "348": "adc", "349": "inc", "350": "fiadd", "351": "stosd", "352": "fdecstp", "353": "stosb", "354": "mulss", "355": "movmskps", "356": "paddd", "357": "fptan", "358": "orps", "359": "stosw", "360": "jns", "361": "pfcmpge", "362": "movmskpd", "363": "in", "364": "setb", "365": "pshufb", "366": "minsd", "367": "seto", "368": "pshufd", "369": "jbe", "370": "setp", "371": "pshufw", "372": "setz", "373": "fbstp", "374": "vmptrst", "375": "femms", "376": "lds", "377": "movdqu", "378": "rdmsr", "379": "cmpltpd", "380": "fxtract", "381": "cmpltps", "382": "cmpsd", "383": "mulsd", "384": "vpaddusw", "385": "fmulp", "386": "vmwrite", "387": "mov", "388": "fsin", "389": "pop", "390": "div", "391": "vmread", "392": "pfadd", "393": "rsqrtss", "394": "emms", "395": "vsqrtpd", "396": "vdivps", "397": "rcpps", "398": "add", "399": "movzx", "400": "jle", "401": "pushf", "402": "pext", "403": "sgdt", "404": "lddqu", "405": "bsf", "406": "jecxz", "407": "rdpmc", "408": "psllw", "409": "ficom", "410": "psadbw", "411": "bt", "412": "pcmpeqw", "413": "setnl", "414": "mulpd", "415": "movsb", "416": "addpd", "417": "psubusb", "418": "comiss", "419": "movsx", "420": "unpcklps", "421": "movss", "422": "phminposuw", "423": "pmaddubsw", "424": "fchs", "425": "stmxcsr", "426": "subsd", "427": "jo", "428": "rcr", "429": "vminsd", "430": "rcl", "431": "or", "432": "subss", "433": "call", "434": "rsm", "435": "vmovdqa", "436": "rsqrtps", "437": "vpmullw", "438": "fpatan", "439": "movntdq", "440": "psrldq", "441": "cmpxchg", "442": "vzeroupper", "443": "fsubr", "444": "pfnacc", "445": "frndint", "446": "lldt", "447": "pmovmskb", "448": "fdiv", "449": "packusdw", "450": "fldcw", "451": "mpsadbw", "452": "psubsw", "453": "fldz", "454": "fist", "455": "sldt", "456": "packssdw", "457": "fninit", "458": "cbw", "459": "fcmovnb", "460": "fcmovne", "461": "paddb", "462": "cmpsw", "463": "phaddd", "464": "paddw", "465": "cmpsb", "466": "test", "467": "phaddw", "468": "out", "469": "fcmovnu", "470": "vmovdqu", "471": "fprem", "472": "movhps", "473": "vmptrld", "474": "pswapd", "475": "loopne", "476": "fscale", "477": "fst", "478": "push", "479": "pavgw", "480": "const", "481": "loc", "482": "endp", "483": "stop_line", "484": "subprocess"}