{"psrlq": 2, "rol": 3, "psrlw": 250, "cmpnlepd": 5, "vpermilps": 6, "cmpneqps": 253, "vorpd": 8, "vsubps": 9, "psrld": 10, "lgs": 319, "ror": 12, "const": 480, "fchs": 424, "scasw": 14, "pblendvb": 16, "maxss": 17, "vpmullw": 437, "scasd": 18, "scasb": 19, "fistp": 94, "unpckhps": 20, "wbinvd": 21, "vdivsd": 23, "unpckhpd": 24, "punpckldq": 26, "pextrw": 27, "cmc": 30, "leave": 31, "pextrd": 32, "pextrb": 33, "fcmovnbe": 34, "cmp": 36, "psubd": 254, "psubb": 197, "psubw": 38, "setnle": 39, "pandn": 40, "fxam": 41, "psubq": 217, "extractps": 220, "xor": 44, "sub": 45, "fcompp": 286, "neg": 46, "jcxz": 281, "xchg": 338, "vpsllw": 48, "lea": 49, "paddusw": 50, "addpd": 416, "les": 51, "paddusb": 52, "wait": 54, "fnstsw": 317, "pfsubr": 55, "minss": 57, "xorpd": 58, "xorps": 298, "pminsw": 95, "fsub": 62, "clflush": 63, "pfrcp": 64, "cmovge": 65, "fsqrt": 67, "setno": 68, "setnl": 413, "faddp": 69, "setnb": 70, "call": 433, "setnz": 71, "setns": 73, "setnp": 74, "fcomi": 75, "jmp": 76, "rcpss": 77, "fcomp": 81, "vpsrad": 82, "fcmovbe": 84, "vpaddusw": 384, "fnsave": 85, "cmpps": 86, "dec": 87, "fld": 88, "addsd": 89, "movaps": 90, "pslld": 91, "xabort": 190, "fucom": 80, "pslldq": 92, "movapd": 93, "addss": 96, "movlpd": 97, "psllw": 408, "psllq": 98, "minps": 99, "ficomp": 100, "pcmpgtw": 101, "vmovups": 102, "getsec": 103, "idiv": 104, "pcmpgtb": 105, "pcmpgtd": 106, "pmaxub": 147, "punpckhbw": 107, "fucompp": 108, "insb": 109, "insd": 110, "iret": 111, "vunpckhps": 112, "pshuflw": 113, "insw": 114, "lidt": 196, "lar": 115, "sfence": 116, "lodsw": 117, "subpd": 118, "fldenv": 119, "cmovns": 120, "vmovddup": 284, "subps": 225, "lodsb": 227, "lodsd": 124, "enter": 125, "cli": 191, "movhpd": 302, "jnp": 126, "fnclex": 127, "sqrtsd": 128, "jnz": 129, "movd": 78, "imul": 130, "jnb": 131, "sqrtss": 132, "lss": 134, "pand": 135, "jno": 320, "fisub": 136, "movq": 276, "pinsrw": 137, "monitor": 138, "divps": 139, "cld": 140, "punpckhwd": 297, "clc": 141, "pinsrd": 142, "pmovzxwd": 143, "fbld": 343, "fadd": 144, "movntps": 145, "sysret": 146, "shufpd": 148, "prefetchw": 149, "movzx": 399, "fdivp": 72, "shufps": 150, "fdivr": 151, "ftst": 152, "pmulhuw": 153, "not": 154, "nop": 156, "xbegin": 157, "pminuw": 162, "hlt": 163, "loope": 164, "comisd": 165, "cmpleps": 166, "lfs": 167, "comiss": 418, "pminub": 168, "fsubrp": 169, "ret": 171, "pmovzxbd": 172, "fdivrp": 173, "insertps": 174, "invd": 175, "cwd": 176, "cmpnlesd": 37, "ucomisd": 177, "sbb": 178, "fidiv": 179, "vmptrst": 374, "ucomiss": 66, "pshufhw": 180, "div": 390, "sahf": 181, "fcos": 182, "cmpeqsd": 7, "movups": 184, "maxps": 187, "fcom": 188, "clts": 189, "psubusb": 417, "palignr": 22, "fdiv": 448, "fmul": 192, "psubusw": 193, "pcmpeqb": 194, "pcmpeqd": 195, "prefetchnta": 268, "roundps": 198, "rsm": 434, "vmovapd": 200, "cmpneqpd": 201, "vrcpss": 202, "UNK": 0, "vmovaps": 255, "std": 204, "paddsw": 205, "psraw": 206, "fisubr": 207, "stc": 208, "fucomp": 209, "sti": 267, "fucomi": 210, "paddsb": 211, "fsubp": 212, "str": 213, "fsubr": 443, "vpcmpgtw": 215, "and": 216, "wrmsr": 43, "sal": 25, "andpd": 218, "fsetpm": 219, "cpuid": 221, "sar": 222, "fxsave": 185, "andps": 223, "cmovno": 122, "pswapd": 474, "fnstenv": 226, "rdmsr": 378, "psadbw": 410, "fsincos": 228, "fnop": 229, "outsw": 230, "bsr": 231, "ffree": 232, "fstp": 233, "outsb": 234, "outsd": 235, "fincstp": 236, "cwde": 237, "punpcklbw": 238, "vpaddw": 240, "divsd": 241, "fimul": 242, "vpshufhw": 243, "divss": 244, "jns": 360, "vpcmpeqw": 245, "popf": 246, "movnti": 15, "subprocess": 484, "fnstcw": 28, "cdq": 247, "pfmax": 248, "fxch": 249, "movntq": 251, "arpl": 252, "pause": 61, "shld": 203, "pfsub": 259, "sysenter": 256, "lsl": 59, "movlps": 123, "punpckhdq": 257, "vandnpd": 258, "shr": 83, "shl": 261, "cmplesd": 262, "bts": 263, "btr": 264, "unpcklpd": 265, "frstor": 266, "packsswb": 269, "btc": 270, "NONE": 1, "setle": 344, "psrad": 271, "ldmxcsr": 272, "vmovd": 273, "pxor": 260, "mul": 275, "vaddps": 277, "endp": 482, "jz": 340, "vmovsd": 279, "jp": 280, "js": 282, "jl": 283, "jo": 427, "jg": 285, "ja": 310, "jb": 287, "sqrtps": 314, "vpshuflw": 288, "cmovp": 289, "cmovs": 290, "cmovl": 291, "cmovo": 292, "cmova": 293, "cmovb": 294, "vshufps": 295, "cmovg": 296, "fidivr": 299, "por": 300, "pop": 389, "pabsw": 301, "unpcklps": 420, "setnbe": 303, "xadd": 304, "movhlps": 305, "retf": 306, "vpmaddwd": 307, "retn": 308, "vpunpckldq": 309, "fisttp": 311, "syscall": 312, "cmovbe": 313, "vmread": 391, "addps": 159, "adc": 348, "sldt": 455, "pmulhrsw": 4, "lgdt": 318, "rdtsc": 11, "align": 322, "phminposuw": 422, "andnpd": 323, "cmovle": 324, "pfcmpgt": 325, "fldpi": 326, "packuswb": 327, "cmpltsd": 328, "lahf": 329, "andnps": 330, "loop": 331, "punpckhqdq": 332, "pmullw": 333, "fcmovu": 334, "fild": 53, "in": 363, "fcmove": 336, "vpunpckhbw": 337, "fcmovb": 339, "pshufb": 365, "fabs": 342, "movlhps": 345, "sysexit": 346, "fiadd": 350, "stosd": 351, "fdecstp": 352, "stosb": 353, "orpd": 170, "movmskps": 355, "fptan": 357, "orps": 358, "stosw": 359, "pavgusb": 60, "pfcmpge": 361, "movmskpd": 362, "setb": 364, "setl": 13, "minsd": 366, "seto": 367, "pshufd": 368, "jbe": 369, "setp": 370, "sets": 47, "stop_line": 483, "pshufw": 371, "setz": 372, "mulss": 354, "fbstp": 373, "femms": 375, "lds": 376, "vmulps": 42, "movdqu": 377, "pmaxsw": 158, "cmpltpd": 379, "add": 398, "vpextrw": 315, "movdqa": 316, "fxtract": 380, "cmpltps": 381, "mulsd": 383, "setbe": 341, "fmulp": 385, "vmwrite": 386, "mov": 387, "fsin": 388, "pfadd": 392, "mulps": 239, "vxorps": 183, "emms": 394, "pmuludq": 199, "vsqrtpd": 395, "vdivps": 396, "rcpps": 397, "jle": 400, "cmovnp": 121, "pext": 402, "rsqrtss": 393, "sgdt": 403, "lddqu": 404, "jge": 278, "jecxz": 406, "rdpmc": 407, "pmaddwd": 29, "pavgb": 35, "ficom": 409, "bt": 411, "pcmpeqw": 412, "mulpd": 414, "movsd": 79, "or": 431, "movsb": 415, "movsx": 419, "punpcklwd": 160, "movsw": 56, "movss": 421, "shrd": 133, "pmaddubsw": 423, "vunpcklps": 155, "stmxcsr": 425, "bsf": 405, "loc": 481, "subsd": 426, "lldt": 446, "rcr": 428, "rcl": 430, "subss": 432, "punpcklqdq": 214, "vmovdqa": 435, "rsqrtps": 436, "fpatan": 438, "vblendps": 224, "movntdq": 439, "psrldq": 440, "cmpxchg": 441, "vzeroupper": 442, "pfnacc": 444, "frndint": 445, "pmovmskb": 447, "pmulhw": 274, "packusdw": 449, "fldcw": 450, "mpsadbw": 451, "psubsw": 452, "fldz": 453, "fist": 454, "int": 161, "pushf": 401, "fcmovnu": 469, "packssdw": 456, "fninit": 457, "cbw": 458, "psubsb": 335, "fcmovnb": 459, "fcmovne": 460, "bswap": 347, "inc": 349, "paddd": 356, "paddb": 461, "cmpsw": 462, "phaddd": 463, "paddw": 464, "cmpsb": 465, "cmpsd": 382, "paddq": 186, "test": 466, "phaddw": 467, "out": 468, "fprem": 471, "movhps": 472, "vmptrld": 473, "vminsd": 429, "pfmul": 321, "loopne": 475, "fscale": 476, "fst": 477, "vmovdqu": 470, "push": 478, "pavgw": 479}